--댓글(Comment) 및 좋아요 도메인
-- ========================
INSERT INTO comments (user_id, article_id, content, like_count) VALUES
(1,1,'유익한 기사네요!',2),
(2,2,'ETF 유입 데이터 참고합니다',1),
(3,3,'외인 수급 추세가 흥미롭네요',3),
(5,4,'빅테크 실적이 핵심이군요',2),
(4,5,'핀테크 투자 사이클 기대',4),
(6,6,'환율 변동 심하네요.',2),
(7,7,'AI 인재 수요 공감합니다.',1),
(8,8,'친환경 정책 응원합니다.',2),
(9,9,'스마트시티 기대돼요.',4),
(10,10,'금리 유지 다행이에요.',5),
(11,11,'AI 의료 발전 굿!',0),
(12,12,'세제 개편 찬성입니다.',2),
(13,13,'ESG 중요하죠.',0),
(14,14,'IPO 뉴스 재밌어요.',1),
(15,15,'AI 경쟁 치열하네요.',3);

INSERT INTO comment_likes (user_id, comment_id) VALUES
(2,1), (3,1),
(1,2), (5,2),
(1,3),
(2,4), (3,4), (5,4),
(1,5), (2,5),
(6,5),
(7,6),(8,7),(9,8),(10,9),(11,10),
(12,11),(13,12),(14,13),(15,14),(13,15);