--관심사(Interest) 및 키워드(Keyword) 도메인
-- =========================
INSERT INTO interests (name) VALUES
('IT 뉴스'), ('블록체인'), ('국내증시'), ('해외증시'), ('스타트업'),
('기술'), ('자동차'), ('여행'), ('건강'), ('교육');

INSERT INTO keywords (keyword) VALUES
('AI'), ('머신러닝'), ('가상화폐'), ('비트코인'),
('투자'), ('거시경제'), ('빅데이터'), ('핀테크'),
('물가'), ('인공지능'), ('아파트'), ('탄소중립'),
('투자'),('금리'), ('대출'), ('기술혁신'),
('자동차산업'), ('헬스케어'), ('여행지'), ('교육정책'),
('패션트렌드'), ('음악시장'), ('영화산업'),
('환경정책'), ('금융시장'), ('스타트업'), ('부동산세제');

INSERT INTO interests_keywords (interest_id, keyword_id) VALUES
(1,1), (1,2), (1,7), (1,15),
(2,1), (2,2), (2,3), (2,4), (2,8),
(3,1), (3,2), (3,3), (3,4), (3,5), (3,6), (3,10), (3,13), (3,15), (3,16), (3,20),
(4,5), (4,6),
(5,1), (5,2), (5,3), (5,4), (5,8), (5,10), (5,16), (5,20),
(6,6), (6,7), (6,8), (6,9),
(7,1), (7,2), (7,3), (7,4), (7,8), (7,10), (7,16), (7,20),
(8,1), (8,2), (8,3), (8,6), (8,9), (8,11), (8,17), (8,21), (8,7),
(9,1), (9,2), (9,3), (9,4), (9,8), (9,10),
(10,1), (10,2), (10,3);
